k1minseok/STM32_Ultrasonic_Driver_0424/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define Ultra_Trigger_Pin GPIO_PIN_0
#define Ultra_Trigger_GPIO_Port GPIOC
#define Ultra_Echo_Pin GPIO_PIN_1
#define Ultra_Echo_GPIO_Port GPIOC
#define Ultra_Echo_EXTI_IRQn EXTI1_IRQn
#define Ultra3_Echo_Pin GPIO_PIN_2
#define Ultra3_Echo_GPIO_Port GPIOC
#define Ultra3_Echo_EXTI_IRQn EXTI2_IRQn
#define Ultra3_Trig_Pin GPIO_PIN_3
#define Ultra3_Trig_GPIO_Port GPIOC
#define Ultra2_Echo_Pin GPIO_PIN_4
#define Ultra2_Echo_GPIO_Port GPIOA
#define Ultra2_Echo_EXTI_IRQn EXTI4_IRQn
#define LED_3_Pin GPIO_PIN_5
#define LED_3_GPIO_Port GPIOC
#define Ultra2_Trig_Pin GPIO_PIN_0
#define Ultra2_Trig_GPIO_Port GPIOB
#define LED_2_Pin GPIO_PIN_6
#define LED_2_GPIO_Port GPIOC
#define LED_1_Pin GPIO_PIN_8
#define LED_1_GPIO_Port GPIOC
#define Button_1_Pin GPIO_PIN_10
#define Button_1_GPIO_Port GPIOC
#define Button_2_Pin GPIO_PIN_11
#define Button_2_GPIO_Port GPIOC
#define Button_3_Pin GPIO_PIN_12
#define Button_3_GPIO_Port GPIOC

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
